Examinator/src/Catalogs/ТерминыЭлектронныхГлоссариев/ТерминыЭлектронныхГлоссариев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТерминыЭлектронныхГлоссариев</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>БукваДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Определение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОпределение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Синонимы</name>
    <comment>Синонимы</comment>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>БукваДляПоиска</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ТерминыЭлектронныхГлоссариев/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция СвойстваТермина(Знач Термин) Экспорт		
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Термин, "Наименование, КраткоеОпределение");	
	
	Реквизиты.Вставить("Термин", Термин);
	Реквизиты.Вставить("Синонимы", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТерминыЭлектронныхГлоссариевСинонимы.Представление КАК Представление,
		|	ТерминыЭлектронныхГлоссариевСинонимы.БукваДляПоиска КАК БукваДляПоиска,
		|	ТерминыЭлектронныхГлоссариевСинонимы.Ссылка КАК Термин
		|ИЗ
		|	Справочник.ТерминыЭлектронныхГлоссариев.Синонимы КАК ТерминыЭлектронныхГлоссариевСинонимы
		|ГДЕ
		|	ТерминыЭлектронныхГлоссариевСинонимы.Ссылка = &Термин";
	
	Запрос.УстановитьПараметр("Термин", Термин);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Реквизиты.Синонимы.Добавить(Новый Структура("Представление, БукваДляПоиска", ВыборкаДетальныеЗаписи.Представление, ВыборкаДетальныеЗаписи.БукваДляПоиска));
	КонецЦикла;
	
	Возврат Реквизиты;

КонецФункции

Функция ПредставлениеСодержитЗапрещенныеСимволы(Знач Представление) Экспорт
	
	Представление = СокрЛП(Представление);
	ЗапрещенныеСимволы = ЗапрещенныеСимволыВПредставлении();
	
	Для каждого ЗапрещенныйСимвол Из ЗапрещенныеСимволы Цикл
		Если СтрНайти(Представление, ЗапрещенныйСимвол) > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ЗапрещенныеСимволыВПредставлении()
	
	// Это служебные символы в регулярных выражениях
	
	ЗапрещенныеСимволы = Новый Массив;
	ЗапрещенныеСимволы.Добавить("/");
	ЗапрещенныеСимволы.Добавить("\");
	ЗапрещенныеСимволы.Добавить("+");
	ЗапрещенныеСимволы.Добавить(".");
	ЗапрещенныеСимволы.Добавить("[");
	ЗапрещенныеСимволы.Добавить("]");
	ЗапрещенныеСимволы.Добавить("^");
	ЗапрещенныеСимволы.Добавить("$");
	ЗапрещенныеСимволы.Добавить("(");
	ЗапрещенныеСимволы.Добавить(")");
	ЗапрещенныеСимволы.Добавить("?");
	ЗапрещенныеСимволы.Добавить(":");
	ЗапрещенныеСимволы.Добавить("*");
	ЗапрещенныеСимволы.Добавить("=");
	ЗапрещенныеСимволы.Добавить("|");
	ЗапрещенныеСимволы.Добавить("{");
	ЗапрещенныеСимволы.Добавить("}");
	
	ЗапрещенныеСимволы.Добавить(Символы.ПС);
	ЗапрещенныеСимволы.Добавить(Символы.ВК);
	ЗапрещенныеСимволы.Добавить(Символы.ВТаб);
	ЗапрещенныеСимволы.Добавить(Символы.НПП);
	ЗапрещенныеСимволы.Добавить(Символы.ПФ);
	ЗапрещенныеСимволы.Добавить(Символы.Таб);
	
	Возврат ЗапрещенныеСимволы;
	
КонецФункции

Функция ЗапрещенныеСимволыСтрокой() Экспорт
	
	ЗапрещенныеСимволы = ЗапрещенныеСимволыВПредставлении();
	Результат = "";
	
	Для каждого ЗапрещенныйСимвол Из ЗапрещенныеСимволы Цикл
		
		Если ЗапрещенныйСимвол = Символы.ПС Тогда
			Результат = Результат + """Перевод строки"", ";
		ИначеЕсли ЗапрещенныйСимвол = Символы.ВК Тогда
			Результат = Результат + """Возврат каретки"", ";
		ИначеЕсли ЗапрещенныйСимвол = Символы.ВТаб
			ИЛИ ЗапрещенныйСимвол = Символы.Таб Тогда
			Результат = Результат + """Символ табуляции"", ";
		ИначеЕсли ЗапрещенныйСимвол = Символы.НПП Тогда
			Результат = Результат + """Неразрывный пробел"", ";
		ИначеЕсли ЗапрещенныйСимвол = Символы.ПФ Тогда
			Результат = Результат + """Перевод формы"", ";
		Иначе
			Результат = Результат + """"+ ЗапрещенныйСимвол +""", ";
		КонецЕсли;
	КонецЦикла;

	Возврат Лев(Результат, СтрДлина(Результат) - 2);
	
КонецФункции

#КонецОбласти


#КонецЕсли
